IRP/src/AccumulationRegisters/SalesTurnovers/SalesTurnovers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>SalesTurnovers</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>NetAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesInvoice</name>
    <type>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/SalesTurnovers/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName", "AccumulationRegister.SalesTurnovers");
	Fields = New Map();
	Fields.Insert("Company", "Company");
	Fields.Insert("SalesInvoice", "SalesInvoice");
	Fields.Insert("Currency", "Currency");
	Fields.Insert("ItemKey", "ItemKey");
	Result.Insert("LockInfo", New Structure("Data, Fields", Data, Fields));
	Return Result;
EndFunction
